#+TITLE:   ThreadStartJoin Performance Measurements
#+AUTHOR:  Foivos S. Zakkak
#+EMAIL:   foivos@zakkak.net
#+STARTUP: hidestars
#+STARTUP: showall

* ThreadStartJoin

  Creates and starts N threads that do nothing (empty run() function)
  then joins on them.

  #+tblname: joinstart
  |---------+-----------------+--------|
  | # Tasks | Total time (ms) | Linear |
  |---------+-----------------+--------|
  |       1 |            1258 |   1258 |
  |      15 |            2045 |  18870 |
  |     255 |           15424 | 320790 |
  |     503 |           29259 | 632774 |
  |---------+-----------------+--------|
  #+TBLFM: $3=@2$2*$1

  #+begin_src gnuplot :var data=joinstart :exports results :file joinstart.pdf
    set title 'Impact of the number of monitor managers on performance'
    set xlabel "Number of Tasks"
    set ylabel "Total execution time (ms per core)\n for 100 monitor enter/exit pairs"
    unset yrange
    set xrange[0:512]
    #set timestamp "generated on %Y-%m-%d by `whoami`"
    unset key
    plot data using 1:2 with linespoints ls 2#, data using 1:3 with lines ls 3 title "Linear" 
  #+end_src

  #+RESULTS:
  [[file:joinstart.pdf]]

